---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.LightingFixture
source: html/a534f7ad-e8f0-e8d4-74d9-9f5b44b0f0ee.htm
---
# LightingFixture Methods

Causes the object to release immediately any resources it may be utilizing.